SeongMin1000/Embedded_System/micro_os/NUCLEO-f429zi_example_code (updated)/Examples/ST/STM32F429II-SK/OS3/app.c
        RTC_SetAlarmDaily();
        continue;
        ;
      }
    }

    // 이 아래는 “실패” 했을 때만 실행됨
    if (mission_fail)
    {
      OSTimeDlyHMSM(0, 0, 0, 700, OS_OPT_TIME_HMSM_STRICT, &err); // 재도전 전 잠깐 쉬기
      continue;                                                   // 바깥 while(DEF_TRUE)로 돌아가서 미션 새로 안내
    }
  }
}

// Knock sensor Task
static void KnockSensorTask(void *p_arg)
{
  OS_ERR err;
  SensorInput input;
  OS_FLAGS flags;
  uint8_t prev, curr;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 미션 시작(터치 플래그)까지 대기
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_KNOCK,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    // 2. 미션 종료(ALARM_FLAG_OFF)까지 반복 감지
    prev = KnockSensor_Read();
    while (1)
    {
      // 미션 종료 플래그 오면 바로 대기 상태로 돌아감
      if (OSFlagPend(&AlarmFlagGroup,
                     ALARM_FLAG_OFF,
                     0,
                     OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_NON_BLOCKING,
                     0,
                     &err))
      {
        break;
      }

      curr = KnockSensor_Read();

      if (curr == Bit_SET && prev == Bit_RESET)
      {
        input.type = SENSOR_KNOCK;
        OSQPost(&SensorInputQ, &input, sizeof(input), OS_OPT_POST_FIFO, &err);

        static const char msg[] = "[노크] 입력 감지됨\r\n";
        OSQPost(&USARTMsgQ, (void *)msg, sizeof(msg), OS_OPT_POST_FIFO, &err);

        // 800ms(혹은 적절한 값) 동안 입력 무시
        OSTimeDlyHMSM(0, 0, 1, 0, OS_OPT_TIME_HMSM_STRICT, &err);
      }
      else
      {
        OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
      }

      prev = curr;
    }
  }
}

// USART Task
static void USARTTask(void *p_arg)
{
  OS_ERR err;
  void *msg;
  OS_MSG_SIZE size;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 메시지 큐에서 문자열 수신 (blocking)
    msg = OSQPend(&USARTMsgQ,
                  0,
                  OS_OPT_PEND_BLOCKING,
                  &size,
                  0,
                  &err);

    if (err == OS_ERR_NONE && msg != NULL)
    {
      // 문자열 출력
      USART_SendString((char *)msg);
    }
  }
}
